cases/TFM/0.orig/T.snow
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 285;

boundaryField
{
    inlet
    {
        type            cyclic;
    }

    bottom.snow
    {
        type            fixedValue;
        value           uniform 285;
    }

    top
    {
        type            zeroGradient;
    }

    sides
    {
        type            empty;
    }

    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
