cases/TFM/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             Euler;
}

gradSchemes
{
    default             Gauss linear;
}

divSchemes
{
    default                         none;
    "div\(phi,alpha.*\)"            Gauss vanLeer;
    "div\(phir,alpha.*\)"           Gauss vanLeer;

    "div\(alphaRhoPhi.*,U.*\)"       Gauss linearUpwind limited;
    "div\(phi.*,U.*\)"               Gauss linearUpwind limited;

    "div\(alphaRhoPhi.*,(h|e).*\)"   Gauss limitedLinear 1;
    "div\(alphaRhoPhi.*,K.*\)"       Gauss limitedLinear 1;
    "div\(alphaPhi.*,p\)"            Gauss limitedLinear 1;

    div(alphaRhoPhi.snow,Theta.snow) Gauss limitedLinear 1;
    "div\(devRhoReff.*\)"            Gauss linear;

    "div\(alphaRhoPhi.*,(k|epsilon).*\)"  Gauss limitedLinear 1;

    div((((alpha.air*thermo:rho.air)*nuEff.air)*dev2(T(grad(U.air))))) Gauss linear;

    div((((thermo:rho.snow*nut.snow)*dev2(T(grad(U.snow))))+(((thermo:rho.snow*lambda.snow)*div(phi.snow))*I)))  Gauss linear;
    div(((thermo:rho.snow*nut.snow)*dev2(T(grad(U.snow)))))  Gauss linear;
    div((((alpha.snow*thermo:rho.snow)*nuEff.snow)*dev2(T(grad(U.snow)))))  Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear uncorrected;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             uncorrected;
}

wallDist
{
    method              meshWave;
}


// ************************************************************************* //
